In [4]:
import pandas as pd

p=pd.Series((1,2,3),index=("one","two","three"))
p

one      1
two      2
three    3
dtype: int64

In [15]:
import pandas as pd

# Create a DataFrame
data = {'Name': ['John', 'Anna', 'Peter', 'Linda',"Abhi","Ashi"],
        'Age': [28, 35, 25, 41,35,28],
        'City': ['New York', 'Paris', 'Paris', 'New York',"India","India"]}

df = pd.DataFrame(data)
df

    Name  Age      City
0   John   28  New York
1   Anna   35     Paris
2  Peter   25     Paris
3  Linda   41  New York
4   Abhi   35     India
5   Ashi   28     India

### Partcipants with Age Greater than 30

In [16]:
# Filter data based on a condition
filtered_df = df[df['Age'] > 30]
filtered_df

    Name  Age      City
1   Anna   35     Paris
3  Linda   41  New York
4   Abhi   35     India

In [17]:
# Sort DataFrame by Age
sorted_df = df.sort_values(by='Age',ascending=False)
sorted_df

    Name  Age      City
3  Linda   41  New York
1   Anna   35     Paris
4   Abhi   35     India
0   John   28  New York
5   Ashi   28     India
2  Peter   25     Paris

In [18]:
# Group data by City and calculate average age
grouped_df = df.groupby('City').mean()
grouped_df

           Age
City
India     31.5
New York  34.5
Paris     30.0